// --- Icon Components ---
// SVG 아이콘들

//GirlIcon
//BoyIcon
//EditIcon
//DeleteIcon
//CalendarIcon
//AbledCheckCircleIcon
//NaverIcon
//GoogleIcon
//Leftcc
//RightArrow
//LeftArrow
//HomeIcon
//PrimaryCheckIcon

// 여자 아이 아이콘
export const GirlIcon = () => (
  <svg
    width="100"
    height="100"
    viewBox="0 0 100 100"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <rect width="100" height="100" rx="50" fill="white" />
    <circle cx="23.8363" cy="52.5506" r="6.17807" fill="#FFDAD2" />
    <circle
      cx="23.8363"
      cy="52.5506"
      r="6.17807"
      fill="black"
      fillOpacity="0.02"
    />
    <circle cx="76.1634" cy="52.5506" r="6.17807" fill="#FFDAD2" />
    <circle
      cx="76.1634"
      cy="52.5506"
      r="6.17807"
      fill="black"
      fillOpacity="0.02"
    />
    <circle cx="49.5902" cy="50.7162" r="26.9974" fill="#FFDAD2" />
    <circle cx="41.8752" cy="52.0374" r="2.74927" fill="#191F28" />
    <circle cx="57.3049" cy="52.0374" r="2.74927" fill="#191F28" />
    <path
      d="M49.5898 23.7188C64.5001 23.7188 76.5878 35.8056 76.5879 50.7158C76.5879 50.893 76.5835 51.0698 76.5801 51.2461C71.7697 50.6926 65.5745 48.1339 59.5693 43.8838C55.4896 40.9963 52.0966 37.7502 49.6514 34.5859C47.1685 37.7742 43.7038 41.046 39.5322 43.9395C33.5478 48.0903 27.3926 50.582 22.5977 51.123C22.5957 50.9876 22.5928 50.8518 22.5928 50.7158C22.5928 35.8056 34.6797 23.7188 49.5898 23.7188Z"
      fill="#333D4B"
    />
    <path
      d="M56.4217 60.4043C56.4217 61.3014 56.245 62.1898 55.9017 63.0186C55.5584 63.8474 55.0552 64.6005 54.4208 65.2349C53.7865 65.8692 53.0334 66.3724 52.2045 66.7157C51.3757 67.0591 50.4874 67.2358 49.5903 67.2358C48.6931 67.2358 47.8048 67.0591 46.976 66.7157C46.1471 66.3724 45.394 65.8692 44.7597 65.2349C44.1253 64.6005 43.6221 63.8474 43.2788 63.0186C42.9355 62.1898 42.7588 61.3014 42.7588 60.4043L49.5903 60.4043H56.4217Z"
      fill="#FF5E5E"
    />
    <path
      d="M56.4217 60.4043C56.4217 61.3014 56.245 62.1898 55.9017 63.0186C55.5584 63.8474 55.0552 64.6005 54.4208 65.2349C53.7865 65.8692 53.0334 66.3724 52.2045 66.7157C51.3757 67.0591 50.4874 67.2358 49.5903 67.2358C48.6931 67.2358 47.8048 67.0591 46.976 66.7157C46.1471 66.3724 45.394 65.8692 44.7597 65.2349C44.1253 64.6005 43.6221 63.8474 43.2788 63.0186C42.9355 62.1898 42.7588 61.3014 42.7588 60.4043L49.5903 60.4043H56.4217Z"
      fill="black"
      fillOpacity="0.05"
    />
    <circle cx="28.3916" cy="32.1826" r="9.89551" fill="#333D4B" />
    <circle cx="71.6074" cy="32.1826" r="9.89551" fill="#333D4B" />
    <path
      d="M51.8583 46.229C44.6726 42.9418 46.8258 35.4951 48.8006 32.1826H57.3049C53.4827 33.7115 50.7758 41.0403 51.8583 46.229Z"
      fill="#333D4B"
    />
  </svg>
);

// 남자 아이 아이콘
export const BoyIcon = () => (
  <svg
    width="100"
    height="100"
    viewBox="0 0 100 100"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <rect width="100" height="100" rx="50" fill="white" />
    <circle cx="23.8363" cy="51.8343" r="6.17807" fill="#FFDAD2" />
    <circle
      cx="23.8363"
      cy="51.8343"
      r="6.17807"
      fill="black"
      fillOpacity="0.02"
    />
    <circle cx="76.1634" cy="51.8343" r="6.17807" fill="#FFDAD2" />
    <circle
      cx="76.1634"
      cy="51.8343"
      r="6.17807"
      fill="black"
      fillOpacity="0.02"
    />
    <circle cx="49.5902" cy="49.9999" r="26.9974" fill="#FFDAD2" />
    <circle cx="41.8752" cy="51.321" r="2.74927" fill="#191F28" />
    <circle cx="57.3049" cy="51.321" r="2.74927" fill="#191F28" />
    <path
      d="M49.5898 23.0024C64.4255 23.0024 76.4638 34.9686 76.584 49.7759C71.773 49.2343 65.5761 46.7257 59.5693 42.5591C55.4896 39.7291 52.0966 36.548 49.6514 33.4468C47.1685 36.5715 43.7039 39.7779 39.5322 42.6138C33.5475 46.6821 27.392 49.1247 22.5967 49.6548C22.7813 34.9035 34.7948 23.0025 49.5898 23.0024Z"
      fill="#333D4B"
    />
    <path
      d="M50.9745 47.229C43.7888 43.9418 45.942 36.4951 47.9168 33.1826H56.4211C52.599 34.7115 49.892 42.0403 50.9745 47.229Z"
      fill="#333D4B"
    />
    <path
      d="M56.4217 59.688C56.4217 60.5851 56.245 61.4734 55.9017 62.3023C55.5584 63.1311 55.0552 63.8842 54.4208 64.5186C53.7865 65.1529 53.0334 65.6561 52.2045 65.9994C51.3757 66.3428 50.4874 66.5195 49.5903 66.5195C48.6931 66.5195 47.8048 66.3428 46.976 65.9994C46.1471 65.6561 45.394 65.1529 44.7597 64.5186C44.1253 63.8842 43.6221 63.1311 43.2788 62.3023C42.9355 61.4734 42.7588 60.5851 42.7588 59.688L49.5903 59.688H56.4217Z"
      fill="#FF5E5E"
    />
    <path
      d="M56.4217 59.688C56.4217 60.5851 56.245 61.4734 55.9017 62.3023C55.5584 63.1311 55.0552 63.8842 54.4208 64.5186C53.7865 65.1529 53.0334 65.6561 52.2045 65.9994C51.3757 66.3428 50.4874 66.5195 49.5903 66.5195C48.6931 66.5195 47.8048 66.3428 46.976 65.9994C46.1471 65.6561 45.394 65.1529 44.7597 64.5186C44.1253 63.8842 43.6221 63.1311 43.2788 62.3023C42.9355 61.4734 42.7588 60.5851 42.7588 59.688L49.5903 59.688H56.4217Z"
      fill="black"
      fillOpacity="0.05"
    />
  </svg>
);

// 수정 아이콘
export const EditIcon = () => (
  <svg
    width="20"
    height="20"
    viewBox="0 0 20 20"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      d="M13.0779 4.50136C13.2368 4.34241 13.4255 4.21632 13.6332 4.1303C13.8409 4.04428 14.0635 4 14.2883 4C14.513 4 14.7356 4.04428 14.9433 4.1303C15.151 4.21632 15.3397 4.34241 15.4986 4.50136C15.6576 4.66031 15.7837 4.84901 15.8697 5.05669C15.9557 5.26436 16 5.48695 16 5.71174C16 5.93653 15.9557 6.15912 15.8697 6.3668C15.7837 6.57447 15.6576 6.76317 15.4986 6.92212L7.32855 15.0922L4 16L4.90779 12.6714L13.0779 4.50136Z"
      stroke="#6B7684"
      strokeWidth="2"
      strokeLinecap="round"
      strokeLinejoin="round"
    />
  </svg>
);

// 삭제 아이콘
export const DeleteIcon = () => (
  <svg
    width="20"
    height="20"
    viewBox="0 0 20 20"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      d="M15 5L5 15"
      stroke="#6B7684"
      strokeWidth="2"
      strokeLinecap="round"
      strokeLinejoin="round"
    />
    <path
      d="M5 5L15 15"
      stroke="#6B7684"
      strokeWidth="2"
      strokeLinecap="round"
      strokeLinejoin="round"
    />
  </svg>
);

// 캘린더 아이콘 (모달용)
export const CalendarIcon = () => (
  <svg
    width="20"
    height="20"
    viewBox="0 0 20 20"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <path
      d="M13.333 2.5V5.83333M6.66634 2.5V5.83333M3.33301 9.16667H16.6663M3.33301 5.83333C3.33301 5.39131 3.5086 4.96738 3.82116 4.65482C4.13372 4.34226 4.55765 4.16667 4.99967 4.16667H14.9997C15.4417 4.16667 15.8656 4.34226 16.1782 4.65482C16.4907 4.96738 16.6663 5.39131 16.6663 5.83333V15.8333C16.6663 16.2754 16.4907 16.6993 16.1782 17.0118C15.8656 17.3244 15.4417 17.5 14.9997 17.5H4.99967C4.55765 17.5 4.13372 17.3244 3.82116 17.0118C3.5086 16.6993 3.33301 16.2754 3.33301 15.8333V5.83333Z"
      stroke="#6B7684"
      strokeWidth="1.5"
      strokeLinecap="round"
      strokeLinejoin="round"
    />
  </svg>
);

export const AbledCheckCircleIcon = () => (
  <svg
    width="60"
    height="60"
    viewBox="0 0 60 60"
    fill="none"
    xmlns="http://www.w3.org/2000/svg"
  >
    <rect width="60" height="60" rx="30" fill="#FFE9E0" />
    <path
      d="M21.249 29.9995L27.499 36.2495L39.999 23.7495"
      stroke="#FF6B31"
      strokeWidth="6"
      strokeLinecap="round"
      strokeLinejoin="round"
    />
  </svg>
);



export const NaverIcon = () => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    width="24"
    height="24"
    viewBox="0 0 24 24"
    fill="none"
    className="w-6 h-6"
  >
    <path
      fill="#fff"
      d="M4 4h4.667l5.333 7.467V4H20v16h-4.667l-5.333-7.467V20H4V4Z"
    />
  </svg>
);

export const GoogleIcon = () => (
  <svg
    xmlns="http://www.w3.org/2000/svg"
    viewBox="0 0 48 48"
    width="24"
    height="24"
    fill="none"
    className="w-5 h-5"
  >
    <path
      fill="#EA4335"
      d="M24 9.5c3.54 0 6.71 1.22 9.21 3.6l6.85-6.85C35.9 2.38 30.47 0 24 0 14.62 0 6.51 5.38 2.56 13.22l7.98 6.19C12.43 13.72 17.74 9.5 24 9.5z"
    ></path>
    <path
      fill="#4285F4"
      d="M46.98 24.55c0-1.57-.15-3.09-.38-4.55H24v9.02h12.94c-.58 2.96-2.26 5.48-4.78 7.18l7.73 6c4.51-4.18 7.09-10.36 7.09-17.65z"
    ></path>
    <path
      fill="#FBBC05"
      d="M10.53 28.59c-.48-1.45-.76-2.99-.76-4.59s.27-3.14.76-4.59l-7.98-6.19C.92 16.46 0 20.12 0 24c0 3.88.92 7.54 2.56 10.78l7.97-6.19z"
    ></path>
    <path
      fill="#34A853"
      d="M24 48c6.48 0 11.93-2.13 15.89-5.81l-7.73-6c-2.15 1.45-4.92 2.3-8.16 2.3-6.26 0-11.57-4.22-13.47-9.91l-7.98 6.19C6.51 42.62 14.62 48 24 48z"
    ></path>
    <path fill="none" d="M0 0h48v48H0z"></path>
  </svg>
);

export const Leftcc=()=>(
  <svg width="8" height="14" viewBox="0 0 8 14" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M7 1L1 7L7 13"  strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
</svg>


);

export const RightArrow=()=>(
<svg width="8" height="14" viewBox="0 0 8 14" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M1 1L7 7L1 13" strokeWidth="2" strokeLinecap="round" strokeLinejoin="round"/>
</svg>

);
export const LeftArrow=()=>(
 <svg width="28" height="24" viewBox="0 0 28 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M2 12H25.3333M2 12L12 22M2 12L12 2" strokeWidth="4" strokeLinecap="round" strokeLinejoin="round"/>
</svg>

);


export const HomeIcon=()=>(
  <svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M7.5 17.5V12.5C7.5 12.058 7.67559 11.634 7.98816 11.3215C8.30072 11.0089 8.72464 10.8333 9.16667 10.8333H10.8333C11.2754 10.8333 11.6993 11.0089 12.0118 11.3215C12.3244 11.634 12.5 12.058 12.5 12.5V17.5M4.16667 10H2.5L10 2.5L17.5 10H15.8333V15.8333C15.8333 16.2754 15.6577 16.6993 15.3452 17.0118C15.0326 17.3244 14.6087 17.5 14.1667 17.5H5.83333C5.39131 17.5 4.96738 17.3244 4.65482 17.0118C4.34226 16.6993 4.16667 16.2754 4.16667 15.8333V10Z" stroke="#4E5968" strokeWidth="1.5" strokeLinecap="round" strokeLinejoin="round"/>
</svg>

);

export const PrimaryCheckIcon=()=>(
<svg width="20" height="20" viewBox="0 0 20 20" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M16.6668 5L7.50016 14.1667L3.3335 10" stroke="#FF6B31" strokeWidth="3" strokeLinecap="round" strokeLinejoin="round"/>
</svg>
);

export const DownSideBarIcon=()=>(
<svg width="24" height="24" viewBox="0 0 24 24" fill="none" xmlns="http://www.w3.org/2000/svg">
<path d="M12.4344 15.1276C12.1979 15.3757 11.8021 15.3757 11.5656 15.1276L7.84406 11.2222C7.48009 10.8403 7.75082 10.2083 8.27842 10.2083L15.7216 10.2083C16.2492 10.2083 16.5199 10.8403 16.1559 11.2222L12.4344 15.1276Z" fill="#191F28"/>
</svg>
);